{
  "jose": {
    "name": "Jose Luis Hernández",
    "role": "Full Stack Developer",
    "description": "Hi, I’m Jose, a Full-Stack Developer with a passion for building dynamic, user-friendly web applications. I specialize in both front-end and back-end development. I enjoy solving complex problems and delivering clean code."
  },
  "experience": {
    "title": "Experience",
    "items": [
      {
        "year": "2024 - 3 months",
        "role": "Junior Web Developer",
        "company": "Vicomtech",
        "description": "Developed and maintained web applications using JavaScript, React.js, and NestJS. Designed and implemented RESTful APIs for seamless data communication. Collaborated with cross-functional teams to deliver high-quality software on time.",
        "technologies": ["Docker", "React.js", "Nest.js", "Jest", "MySQL"]
      },
      {
        "year": "2021 - 2022",
        "role": "IT Technician",
        "company": "Disconsu",
        "description": "Performed computer repairs and maintenance, provided sales advice for IT equipment, and offered remote phone support. Ensured efficient troubleshooting and resolution of technical issues, delivering high-quality customer service.",
        "technologies": ["Anydesk", "Windows", "CrystalDiskInfo", "FurMark"]
      }
    ]
  },
  "projects": {
    "title": "Projects",
    "items": [
      {
        "img": "../src/assets/projects/project1.jpg",
        "title": "Honey Shop - E-Commerce Platform (IN PROCESS)",
        "description": "An e-commerce platform built for an online honey store, offering a seamless shopping experience for customers to browse and purchase premium, organic honey products. The application features a responsive design, optimized product pages, and a secure checkout process. Optimized for SEO.",
        "technologies": ["React", "Next.js", "Tailwindcss"]
      },
      {
        "img": "../src/assets/projects/project2.jpg",
        "title": "Responsive Landing Page",
        "description": "An application for managing tasks and projects, with features such as task creation, assignment, and progress tracking.",
        "technologies": ["React", "Tailwind CSS"]
      }
    ]
  },
  "contact": {
    "contactMe": "Contact me",
    "address": "Irún / Badajoz",
    "phoneNo": "+34 640822571",
    "email": "Heernandezjoseluis98@gmail.com"
  }
}
